susanw1/zscript/receivers/native/arm/implementations/no-os-stm32/src/main/c++/stm32/AlternateFunction/STM32U5x.h
#define I2C4_SMBA_PA14 (JTCK/SWCLK)_ PA14 (JTCK/SWCLK),GPIO_AF5
#define I2C4_SMBA_PD11_ PD11,GPIO_AF4
#define I2C4_SMBA_PF13_ PF13,GPIO_AF4
#define _I2C4_SMBA_PA14 (JTCK/SWCLK)_ 1
#define _I2C4_SMBA_PD11_ 1
#define _I2C4_SMBA_PF13_ 1

#define IR_OUT_PA13 (JTMS/SWDIO)_ PA13 (JTMS/SWDIO),GPIO_AF1
#define IR_OUT_PB9_ PB9,GPIO_AF1
#define _IR_OUT_PA13 (JTMS/SWDIO)_ 1
#define _IR_OUT_PB9_ 1

#define LPTIM1_CH1_PA14 (JTCK/SWCLK)_ PA14 (JTCK/SWCLK),GPIO_AF1
#define LPTIM1_CH1_PB2_ PB2,GPIO_AF1
#define LPTIM1_CH1_PB3 (JTDO/TRACESWO)_ PB3 (JTDO/TRACESWO),GPIO_AF2
#define LPTIM1_CH1_PC1_ PC1,GPIO_AF1
#define LPTIM1_CH1_PG15_ PG15,GPIO_AF1
#define _LPTIM1_CH1_PA14 (JTCK/SWCLK)_ 1
#define _LPTIM1_CH1_PB2_ 1
#define _LPTIM1_CH1_PB3 (JTDO/TRACESWO)_ 1
#define _LPTIM1_CH1_PC1_ 1
#define _LPTIM1_CH1_PG15_ 1

#define LPTIM1_CH2_PA1_ PA1,GPIO_AF0
#define LPTIM1_CH2_PB4 (NJTRST)_ PB4 (NJTRST),GPIO_AF1
#define LPTIM1_CH2_PG14_ PG14,GPIO_AF1
#define _LPTIM1_CH2_PA1_ 1
#define _LPTIM1_CH2_PB4 (NJTRST)_ 1
#define _LPTIM1_CH2_PG14_ 1

#define LPTIM1_ETR_PB6_ PB6,GPIO_AF1
#define LPTIM1_ETR_PC3_ PC3,GPIO_AF1
#define LPTIM1_ETR_PG12_ PG12,GPIO_AF1
#define _LPTIM1_ETR_PB6_ 1
#define _LPTIM1_ETR_PC3_ 1
#define _LPTIM1_ETR_PG12_ 1

#define LPTIM1_IN1_PB5_ PB5,GPIO_AF1
#define LPTIM1_IN1_PC0_ PC0,GPIO_AF1
#define LPTIM1_IN1_PG10_ PG10,GPIO_AF1
#define _LPTIM1_IN1_PB5_ 1
#define _LPTIM1_IN1_PC0_ 1
#define _LPTIM1_IN1_PG10_ 1

#define LPTIM1_IN2_PB7_ PB7,GPIO_AF1
#define LPTIM1_IN2_PC2_ PC2,GPIO_AF1
#define LPTIM1_IN2_PG11_ PG11,GPIO_AF1
#define _LPTIM1_IN2_PB7_ 1
#define _LPTIM1_IN2_PC2_ 1
#define _LPTIM1_IN2_PG11_ 1

#define LPTIM2_CH1_PA4_ PA4,GPIO_AF14
#define LPTIM2_CH1_PA8_ PA8,GPIO_AF14
#define LPTIM2_CH1_PD13_ PD13,GPIO_AF14
#define _LPTIM2_CH1_PA4_ 1
#define _LPTIM2_CH1_PA8_ 1
#define _LPTIM2_CH1_PD13_ 1

#define LPTIM2_CH2_PA7_ PA7,GPIO_AF13
#define LPTIM2_CH2_PC7_ PC7,GPIO_AF14
#define LPTIM2_CH2_PD10_ PD10,GPIO_AF2
#define _LPTIM2_CH2_PA7_ 1
#define _LPTIM2_CH2_PC7_ 1
#define _LPTIM2_CH2_PD10_ 1

#define LPTIM2_ETR_PA5_ PA5,GPIO_AF14
#define LPTIM2_ETR_PC3_ PC3,GPIO_AF14
#define LPTIM2_ETR_PD11_ PD11,GPIO_AF14
#define _LPTIM2_ETR_PA5_ 1
#define _LPTIM2_ETR_PC3_ 1
#define _LPTIM2_ETR_PD11_ 1

#define LPTIM2_IN1_PB1_ PB1,GPIO_AF14
#define LPTIM2_IN1_PC0_ PC0,GPIO_AF14
#define LPTIM2_IN1_PD12_ PD12,GPIO_AF14
#define _LPTIM2_IN1_PB1_ 1
#define _LPTIM2_IN1_PC0_ 1
#define _LPTIM2_IN1_PD12_ 1

#define LPTIM2_IN2_PA10_ PA10,GPIO_AF2
#define LPTIM2_IN2_PB15_ PB15,GPIO_AF2
#define LPTIM2_IN2_PD9_ PD9,GPIO_AF2
#define _LPTIM2_IN2_PA10_ 1
#define _LPTIM2_IN2_PB15_ 1
#define _LPTIM2_IN2_PD9_ 1

#define LPTIM3_CH1_PB0_ PB0,GPIO_AF4
#define LPTIM3_CH1_PB10_ PB10,GPIO_AF2
#define LPTIM3_CH1_PC3_ PC3,GPIO_AF2
#define LPTIM3_CH1_PC8_ PC8,GPIO_AF14
#define LPTIM3_CH1_PD14_ PD14,GPIO_AF14
#define LPTIM3_CH1_PF5_ PF5,GPIO_AF2
#define _LPTIM3_CH1_PB0_ 1
#define _LPTIM3_CH1_PB10_ 1
#define _LPTIM3_CH1_PC3_ 1
#define _LPTIM3_CH1_PC8_ 1
#define _LPTIM3_CH1_PD14_ 1
#define _LPTIM3_CH1_PF5_ 1

#define LPTIM3_CH2_PB1_ PB1,GPIO_AF4
#define LPTIM3_CH2_PC9_ PC9,GPIO_AF14
#define LPTIM3_CH2_PD15_ PD15,GPIO_AF14
#define LPTIM3_CH2_PF2_ PF2,GPIO_AF2
#define _LPTIM3_CH2_PB1_ 1
#define _LPTIM3_CH2_PC9_ 1
#define _LPTIM3_CH2_PD15_ 1
#define _LPTIM3_CH2_PF2_ 1

#define LPTIM3_ETR_PB14_ PB14,GPIO_AF2
#define LPTIM3_ETR_PC10_ PC10,GPIO_AF2
#define LPTIM3_ETR_PD10_ PD10,GPIO_AF14
#define LPTIM3_ETR_PF4_ PF4,GPIO_AF2
#define _LPTIM3_ETR_PB14_ 1
#define _LPTIM3_ETR_PC10_ 1
#define _LPTIM3_ETR_PD10_ 1
#define _LPTIM3_ETR_PF4_ 1

#define LPTIM3_IN1_PB13_ PB13,GPIO_AF2
#define LPTIM3_IN1_PC11_ PC11,GPIO_AF2
#define LPTIM3_IN1_PD9_ PD9,GPIO_AF14
#define LPTIM3_IN1_PF3_ PF3,GPIO_AF2
#define _LPTIM3_IN1_PB13_ 1
#define _LPTIM3_IN1_PC11_ 1
#define _LPTIM3_IN1_PD9_ 1
#define _LPTIM3_IN1_PF3_ 1

#define LPTIM4_ETR_PD2_ PD2,GPIO_AF13
#define LPTIM4_ETR_PF12_ PF12,GPIO_AF13
#define _LPTIM4_ETR_PD2_ 1
#define _LPTIM4_ETR_PF12_ 1

#define LPTIM4_IN1_PD13_ PD13,GPIO_AF13
#define LPTIM4_IN1_PF11_ PF11,GPIO_AF13
#define _LPTIM4_IN1_PD13_ 1
#define _LPTIM4_IN1_PF11_ 1

#define LPTIM4_OUT_PD7_ PD7,GPIO_AF13
#define LPTIM4_OUT_PF13_ PF13,GPIO_AF13
#define _LPTIM4_OUT_PD7_ 1
#define _LPTIM4_OUT_PF13_ 1

#define LPUART1_CTS_PA6_ PA6,GPIO_AF8
#define LPUART1_CTS_PB13_ PB13,GPIO_AF8
#define LPUART1_CTS_PG5_ PG5,GPIO_AF8
#define _LPUART1_CTS_PA6_ 1
#define _LPUART1_CTS_PB13_ 1
#define _LPUART1_CTS_PG5_ 1

#define LPUART1_DE_PB1_ PB1,GPIO_AF8
#define LPUART1_DE_PB12_ PB12,GPIO_AF8
#define LPUART1_DE_PG6_ PG6,GPIO_AF8
#define _LPUART1_DE_PB1_ 1
#define _LPUART1_DE_PB12_ 1
#define _LPUART1_DE_PG6_ 1

#define LPUART1_RTS_PB1_ PB1,GPIO_AF8
#define LPUART1_RTS_PB12_ PB12,GPIO_AF8
#define LPUART1_RTS_PG6_ PG6,GPIO_AF8
#define _LPUART1_RTS_PB1_ 1
#define _LPUART1_RTS_PB12_ 1
#define _LPUART1_RTS_PG6_ 1

#define LPUART1_RX_PA3_ PA3,GPIO_AF8
#define LPUART1_RX_PB10_ PB10,GPIO_AF8
#define LPUART1_RX_PC0_ PC0,GPIO_AF8
#define LPUART1_RX_PG8_ PG8,GPIO_AF8
#define _LPUART1_RX_PA3_ 1
#define _LPUART1_RX_PB10_ 1
#define _LPUART1_RX_PC0_ 1
#define _LPUART1_RX_PG8_ 1

#define LPUART1_TX_PA2_ PA2,GPIO_AF8
#define LPUART1_TX_PB11_ PB11,GPIO_AF8
#define LPUART1_TX_PC1_ PC1,GPIO_AF8
#define LPUART1_TX_PG7_ PG7,GPIO_AF8
#define _LPUART1_TX_PA2_ 1
#define _LPUART1_TX_PB11_ 1
#define _LPUART1_TX_PC1_ 1
#define _LPUART1_TX_PG7_ 1

#define MDF1_CCK0_PB8_ PB8,GPIO_AF5
#define MDF1_CCK0_PE9_ PE9,GPIO_AF6
#define MDF1_CCK0_PG7_ PG7,GPIO_AF6
#define _MDF1_CCK0_PB8_ 1
#define _MDF1_CCK0_PE9_ 1
#define _MDF1_CCK0_PG7_ 1

#define MDF1_CCK1_PC2_ PC2,GPIO_AF6
#define MDF1_CCK1_PF10_ PF10,GPIO_AF6
#define _MDF1_CCK1_PC2_ 1
#define _MDF1_CCK1_PF10_ 1

#define MDF1_CKI0_PB2_ PB2,GPIO_AF6
#define MDF1_CKI0_PD4_ PD4,GPIO_AF6
#define _MDF1_CKI0_PB2_ 1
#define _MDF1_CKI0_PD4_ 1

#define MDF1_CKI1_PB13_ PB13,GPIO_AF6
#define MDF1_CKI1_PD7_ PD7,GPIO_AF6
#define _MDF1_CKI1_PB13_ 1
#define _MDF1_CKI1_PD7_ 1

#define MDF1_CKI2_PB15_ PB15,GPIO_AF6
#define MDF1_CKI2_PE8_ PE8,GPIO_AF6
#define _MDF1_CKI2_PB15_ 1
#define _MDF1_CKI2_PE8_ 1

#define MDF1_CKI3_PC6_ PC6,GPIO_AF6
#define MDF1_CKI3_PE5_ PE5,GPIO_AF6
#define _MDF1_CKI3_PC6_ 1
#define _MDF1_CKI3_PE5_ 1

#define MDF1_CKI4_PC1_ PC1,GPIO_AF6
#define MDF1_CKI4_PE11_ PE11,GPIO_AF6
#define _MDF1_CKI4_PC1_ 1
#define _MDF1_CKI4_PE11_ 1

#define MDF1_CKI5_PB7_ PB7,GPIO_AF6
#define MDF1_CKI5_PE13_ PE13,GPIO_AF6
#define _MDF1_CKI5_PB7_ 1
#define _MDF1_CKI5_PE13_ 1

#define MDF1_SDI0_PB1_ PB1,GPIO_AF6
#define MDF1_SDI0_PD3_ PD3,GPIO_AF6
#define _MDF1_SDI0_PB1_ 1
#define _MDF1_SDI0_PD3_ 1

#define MDF1_SDI1_PB12_ PB12,GPIO_AF6
#define MDF1_SDI1_PD6_ PD6,GPIO_AF6
#define _MDF1_SDI1_PB12_ 1
#define _MDF1_SDI1_PD6_ 1

#define MDF1_SDI2_PB14_ PB14,GPIO_AF6
#define MDF1_SDI2_PE7_ PE7,GPIO_AF6
#define _MDF1_SDI2_PB14_ 1
#define _MDF1_SDI2_PE7_ 1

#define MDF1_SDI3_PC7_ PC7,GPIO_AF6
#define MDF1_SDI3_PE4_ PE4,GPIO_AF6
#define _MDF1_SDI3_PC7_ 1
#define _MDF1_SDI3_PE4_ 1

#define MDF1_SDI4_PC0_ PC0,GPIO_AF6
#define MDF1_SDI4_PE10_ PE10,GPIO_AF6
#define _MDF1_SDI4_PC0_ 1
#define _MDF1_SDI4_PE10_ 1

#define MDF1_SDI5_PB6_ PB6,GPIO_AF6
#define MDF1_SDI5_PE12_ PE12,GPIO_AF6
#define _MDF1_SDI5_PB6_ 1
#define _MDF1_SDI5_PE12_ 1

#define OCTOSPIM_P1_CLK_PA3_ PA3,GPIO_AF10
#define OCTOSPIM_P1_CLK_PB10_ PB10,GPIO_AF10
#define OCTOSPIM_P1_CLK_PE10_ PE10,GPIO_AF10
#define OCTOSPIM_P1_CLK_PF10_ PF10,GPIO_AF3
#define _OCTOSPIM_P1_CLK_PA3_ 1
#define _OCTOSPIM_P1_CLK_PB10_ 1
#define _OCTOSPIM_P1_CLK_PE10_ 1
#define _OCTOSPIM_P1_CLK_PF10_ 1

